IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_cm_scb_regs.xml
<module id="SCB" HW_revision="" description="SCB Registers">
	<register id="ACTLR" width="32" page="1" offset="0x8" internal="0" description="Auxiliary Control Register">
		<bitfield id="DISMCYCINT" description="Disable interruption of load/store multiple instruction." begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DISDEFWBUF" description="Disable write buffer on default memory map." begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DISFOLD" description="Disables IT folding." begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="DISFPCA" description="Disables automatic update of CONTROL.FPCA." begin="8" end="8" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUID" width="32" page="1" offset="0xd00" internal="0" description="CPUID Base Register">
		<bitfield id="Revision" description="Revision" begin="3" end="0" width="4" rwaccess="R"/>
		<bitfield id="PartNo" description="PartNo" begin="15" end="4" width="12" rwaccess="R"/>
		<bitfield id="Constant" description="Constant" begin="19" end="16" width="4" rwaccess="R"/>
		<bitfield id="Variant" description="Variant" begin="23" end="20" width="4" rwaccess="R"/>
		<bitfield id="Implementer" description="Implementer" begin="31" end="24" width="8" rwaccess="R"/>
	</register>
	<register id="ICSR" width="32" page="1" offset="0xd04" internal="0" description="Interrupt Control and State Register">
		<bitfield id="VECTACTIVE" description=" Active exception number" begin="8" end="0" width="9" rwaccess="R"/>
		<bitfield id="RETTOBASE" description="Indicates presence of preempted active exceptions." begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="VECTPENDING" description="Exception number of highest priority pending exception." begin="17" end="12" width="6" rwaccess="R"/>
		<bitfield id="ISRPENDING" description="Interrupt pending flag" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="PENDSTCLR" description="SysTick exception clear-pending bit" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="PENDSTSET" description="SysTick exception set-pending bit." begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="PENDSVCLR" description="PendSV clear-pending bit." begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="PENDSVSET" description="PendSV set-pending bit." begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="NMIPENDSET" description="NMI set-pending bit." begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="VTOR" width="32" page="1" offset="0xd08" internal="0" description="Vector Table Offset Register">
		<bitfield id="TBLOFF" description="Vector table offset." begin="31" end="7" width="25" rwaccess="RW"/>
	</register>
	<register id="AIRCR" width="32" page="1" offset="0xd0c" internal="0" description="Application Interrupt and Reset Control Register">
		<bitfield id="VECTRESET" description="CPU Reset" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="VECTCLRACTIVE" description="Reserved for Debug use." begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SYSRESETREQ" description="System reset request bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="PRIGROUP" description="Interrupt priority grouping field" begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="ENDIANNESS" description="Data endianness bit" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="VECTKEY" description="Vector Key." begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="SCR" width="32" page="1" offset="0xd10" internal="0" description="System Control Register">
		<bitfield id="SLEEPONEXIT" description="sleep-on-exit when returning from Handler mode." begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="CCR" width="32" page="1" offset="0xd14" internal="0" description="Configuration and Control Register">
		<bitfield id="NONBASETHRDENA" description="Indicates how the processor enters Thread mode" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="USERSETMPEND" description="Enables unprivileged software access to the STIR." begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="UNALIGN_TRP" description="Enables unaligned access traps." begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="DIV_0_TRP" description="faulting/halting on DIV by 0 exception." begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="BFHFNMIGN" description="Ignore data BusFaults caused by load and store instructions." begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="STKALIGN" description="Indicates stack alignment on exception entry." begin="9" end="9" width="1" rwaccess="RW"/>
	</register>
	<register id="SHPR1" width="32" page="1" offset="0xd18" internal="0" description="System Handler Priority Register 1">
		<bitfield id="PRI_4" description="Priority of system handler 4, MemManage" begin="7" end="5" width="3" rwaccess="RW"/>
		<bitfield id="PRI_5" description="Priority of system handler 5,  BusFault" begin="15" end="13" width="3" rwaccess="RW"/>
		<bitfield id="PRI_6" description="Priority of system handler 6, UsageFault" begin="23" end="21" width="3" rwaccess="RW"/>
	</register>
	<register id="SHPR2" width="32" page="1" offset="0xd1c" internal="0" description="System Handler Priority Register 2">
		<bitfield id="PRI_11" description="Priority of system handler 11, SVCall" begin="31" end="29" width="3" rwaccess="RW"/>
	</register>
	<register id="SHPR3" width="32" page="1" offset="0xd20" internal="0" description="System Handler Priority Register 3">
		<bitfield id="PRI_14" description="Priority of system handler 14, PendSV" begin="23" end="21" width="3" rwaccess="RW"/>
		<bitfield id="PRI_15" description="Priority of system handler 15, SysTick exception" begin="31" end="29" width="3" rwaccess="RW"/>
	</register>
	<register id="SHCSRS" width="32" page="1" offset="0xd24" internal="0" description="System Handler Control and State Register">
		<bitfield id="MEMFAULTACT" description="MemManage exception active bit" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="BUSFAULTACT" description="BusFault exception active bit" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="USGFAULTACT" description="UsageFault exception active bit" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="SVCALLACT" description="SVCall active bit" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="MONITORACT" description="Debug monitor active bit" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="PENDSVACT" description="PendSV exception active bit" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="SYSTICKACT" description="SysTick exception active bit" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="USGFAULTPENDED" description="UsageFault exception pending bit" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="MEMFAULTPENDED" description="MemManage exception pending bit" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="BUSFAULTPENDED" description="BusFault exception pending bit" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="SVCALLPENDED" description="SVCall pending bit" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="MEMFAULTENA" description="MemManage enable bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="BUSFAULTENA" description="BusFault enable bit" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="USGFAULTENA" description="UsageFault enable bit" begin="18" end="18" width="1" rwaccess="RW"/>
	</register>
	<register id="CFSR" width="32" page="1" offset="0xd28" internal="0" description="Configurable Fault Status Register">
		<bitfield id="IACCVIOL" description="Instruction access violation flag" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DACCVIOL" description="Data access violation flag" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="MUNSTKERR" description="MemManage fault on unstacking for a return from exception" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="MSTKERR" description="MemManage fault on stacking for exception entry" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="MMARVALID" description="MemManage Fault Address Register (MMFAR) valid flag" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="IBUSERR" description="Instruction bus error" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="PRECISERR" description="Precise data bus error" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="IMPRECISERR" description="Imprecise data bus error" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="UNSTKERR" description="BusFault on unstacking for a return from exception" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="STKERR" description="BusFault on stacking for exception entry" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="BFARVALID" description="BusFault Address Register (BFAR) valid flag" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="UNDEFINSTR" description="Undefined instruction UsageFault" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="INVSTATE" description="Invalid state UsageFault" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="INVPC" description="Invalid PC load UsageFault" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="NOCP" description="No coprocessor UsageFault" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="UNALIGNED" description="Unaligned access UsageFault" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="DIVBYZERO" description="Divide by zero UsageFault" begin="25" end="25" width="1" rwaccess="RW"/>
	</register>
	<register id="HFSR" width="32" page="1" offset="0xd2c" internal="0" description="HardFault Status Register">
		<bitfield id="VECTTBL" description="BusFault on a vector table read." begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="FORCED" description="Indicates a forced hard fault" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="DEBUGEVT" description="Indicates a forced DEBUG event fault" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="MMFAR" width="32" page="1" offset="0xd34" internal="0" description="MemManage Fault Address Register">
		<bitfield id="ADDRESS" description="Address of the location that generated the MemManage fault" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="BFAR" width="32" page="1" offset="0xd38" internal="0" description="BusFault Address Register">
		<bitfield id="ADDRESS" description="Address of the location that generated the BusFault" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="AFSR" width="32" page="1" offset="0xd3c" internal="0" description="Auxiliary Fault Status Register">
		<bitfield id="ADDRESS" description="The bits map to the AUXFAULT input signals." begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
</module>
